## plan (dev)

Parameter: none

✓ Plan successfull
✓ Plan summary:

| CHANGE |                 RESOURCE                  |
|--------|-------------------------------------------|
| add    | `module.dev_vdi[0].aws_instance.agent[1]` |
|        | `module.dev_vdi[0].aws_instance.cpx[1]`   |
✓ Plan Details:

<details>

<summary>Details of tofu plan</summary>

```console


OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.dev_vdi[0].aws_instance.agent[1] will be created
  + resource "aws_instance" "agent" {
      + ami                                  = "ami-0745b7d4092315796"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "Kasm_SSM_Instance_Profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "on-dev-vdi-ssh-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-00b0c1b939238a613"
      + tags                                 = {
          + "Name"                = "on-dev-vdi-default-kasm-agent-1"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tags_all                             = {
          + "Name"                = "on-dev-vdi-default-kasm-agent-1"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (sensitive value)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-060e78b11c0370f2f",
        ]

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 50
          + volume_type           = (known after apply)
        }
    }

  # module.dev_vdi[0].aws_instance.cpx[1] will be created
  + resource "aws_instance" "cpx" {
      + ami                                  = "ami-0745b7d4092315796"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "Kasm_SSM_Instance_Profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "on-dev-vdi-ssh-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-00687ccd7a7ab5df4"
      + tags                                 = {
          + "Name"                = "on-dev-vdi-default-kasm-cpx-1"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tags_all                             = {
          + "Name"                = "on-dev-vdi-default-kasm-cpx-1"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (sensitive value)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0e5dd30a0525c8299",
        ]

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 50
          + volume_type           = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>


✓ tofu plan: 2 to add, 0 to change, 0 to destroy.
